OdDAI.ADB_Value.getValue(OdDAI.Binary*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets OdDAI::Binary value.
\param getTo [out] the reference to OdDAI::Binary value to get to.
\returns true if the internal type is OdDAI::Binary, otherwise returns false.

OdDAI.ADB_Value.getValue(OdDAI.Number*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets OdDAI::Number value.
\param getTo [out] the reference to OdDAI::Number value to get to.
\returns if the internal type is OdDAI::Number the function returns true, in otherwis returns false.

OdDAI.ADB_Value.setValue(OdDAI.Binary!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets OdDAI::Binary value.
\returns true if succeeded, false otherwise

OdDAI.ADB_Value.setValue(OdDAI.Number!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets OdDAI::Number value.
\returns true if succeeded, false otherwise